# customer-shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-kafka-cluster-id]
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-b7e17127-98c1-423e-8f57-0165c157b6b1]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-customer]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-customer-database-migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production-customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production-customer_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default must be replaced
-/+ resource "cockroach_sql_user" "default" {
      ~ id         = "2539ad74-c3bc-4b10-bb6e-e55edf9e9fbf:production-customer-database-migration" -> (known after apply)
      ~ name       = "production-customer-database-migration" -> "production-customer_database_migration" # forces replacement
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "581ce445-9098-4bdc-8c76-4328c4325ef0" -> "81f33182-0fa5-492f-924f-46cd7fed838b"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic.upstash_kafka_topic.default must be replaced
-/+ resource "upstash_kafka_topic" "default" {
      ~ creation_time    = 1682593694 -> (known after apply)
      ~ id               = "upstash-kafka-topic-b7e17127-98c1-423e-8f57-0165c157b6b1" -> (known after apply)
      ~ multizone        = false -> (known after apply)
      ~ password         = (sensitive value)
      ~ region           = "us-east-1" -> (known after apply)
      ~ rest_endpoint    = "fit-buffalo-6450-us1-rest-kafka.upstash.io" -> (known after apply)
      ~ state            = "active" -> (known after apply)
      ~ tcp_endpoint     = "fit-buffalo-6450-us1-kafka.upstash.io" -> (known after apply)
      ~ topic_id         = "b7e17127-98c1-423e-8f57-0165c157b6b1" -> (known after apply)
      ~ topic_name       = "customer.v1" -> "production.customer.v1" # forces replacement
      ~ username         = "Zml0LWJ1ZmZhbG8tNjQ1MCSB1ZVFpwYiPXA3zTlumF15QJP6Yd4-iQjCtJ9w4sY" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*